In [2]:
import pandas as pd

In [9]:
age = pd.Series([10, 20, 30, 40], index = ['age_01', 'age_02', 'age_03', 'age_04'])
print(age)
print(age.shape)
find_age = age.age_03

# age[age>20]
print(find_age)

# age.values

age.index=['a1', 'a2', 'a3', 'a4']

age

rename_age = age.rename(index = {'a2':'age_02'})

age_01    10
age_02    20
age_03    30
age_04    40
dtype: int64
(4,)
30

a1    10
a2    20
a3    30
a4    40
dtype: int64

# DataFrame

In [18]:
import numpy as np
df = np.array([[20, 10, 8], [25, 8, 10], [27, 5, 3], [30, 9, 7]])
df

np.shape(df)
print(type(df))

data_set = pd.DataFrame(df)
print(data_set)

print(type(data_set))

<class 'numpy.ndarray'>
    0   1   2
0  20  10   8
1  25   8  10
2  27   5   3
3  30   9   7
<class 'pandas.core.frame.DataFrame'>

In [40]:

data_set = pd.DataFrame(df, index = ['s1', 's2', 's3', 's4'], columns = ['Age', 'Grade_01', 'Grade_02'])
print(data_set)
# print(data_set.values)
# print(data_set.iloc[1])
# print(data_set.iloc[1][2])
# print(data_set.iloc[1:3])

print(data_set.iloc[:,:3])
filtered_data = data_set.iloc[:, 1:3]
print(filtered_data)

    Age  Grade_01  Grade_02
s1   20        10         8
s2   25         8        10
s3   27         5         3
s4   30         9         7
    Age  Grade_01  Grade_02
s1   20        10         8
s2   25         8        10
s3   27         5         3
s4   30         9         7
    Grade_01  Grade_02
s1        10         8
s2         8        10
s3         5         3
s4         9         7

In [41]:
# dropping values in dataFrame

drop_column = data_set.drop('Grade_02', axis = 1)
print(drop_column)

    Age  Grade_01
s1   20        10
s2   25         8
s3   27         5
s4   30         9

In [42]:
replace_data = data_set.replace(10,12)
print(replace_data)

    Age  Grade_01  Grade_02
s1   20        12         8
s2   25         8        12
s3   27         5         3
s4   30         9         7

In [43]:
replace_multiple_data = data_set.replace({20:'Twenty', 25:'Twenty Five'})
print(replace_multiple_data)

            Age  Grade_01  Grade_02
s1       Twenty        10         8
s2  Twenty Five         8        10
s3           27         5         3
s4           30         9         7

In [44]:
data_set.head(3)

    Age  Grade_01  Grade_02
s1   20        10         8
s2   25         8        10
s3   27         5         3

In [46]:
data_set.tail(2)

    Age  Grade_01  Grade_02
s3   27         5         3
s4   30         9         7